tello-v12-custom/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     foamRun;
solver          incompressibleFluid;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         1500;
deltaT          1.0;
adjustTimeStep  off;
maxCo           0.9;
writeControl    timeStep;
writeInterval   500;
purgeWrite      5;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable on;

functions
{
    #includeFunc residuals(U,p,k,omega);
    #include "forces";
    forceCoeffs(tello-blade-customv2)
    {
        type forceCoeffs;
        libs ("libforces.so");
        writeControl timeStep;
        writeInterval 100; 
        log true;
        patches (tello-blade-customv2);
        rho rhoInf;
        rhoInf 1.225;
        liftDir (0 0 1);
        dragDir (1 0 0);
        CofR (0 0 0);
        pitchAxis (0 1 0);
        magUInf 79.8;
        lRef 0.0762;
        Aref 0.00456;
    }
    #includeFunc yPlus;
    #includeFunc Q;
    forces
    {
        type forces;
        libs ("libforces.so");
        writeControl timeStep;
        writeInterval 100; 
        log true;
        patches (tello-blade-customv2);
        rho rhoInf;
        log true;
        rhoInf 1.225;
        CofR (0 0 0);
        pitchAxis (0 1 0);
    }
}