tello-v12-custom/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         |
| \\    /   O peration     |
|   \\  /    A nd           |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // 領域サイズ: 0.8m x 0.8m x 1.2m
    // プロペラ中心 (0 0 0) を想定
    
    // Bottom plane (Z = -0.7) 出口側
    (-0.4 -0.4 -0.7) // 0
    ( 0.4 -0.4 -0.7) // 1
    ( 0.4  0.4 -0.7) // 2
    (-0.4  0.4 -0.7) // 3

    // Top plane (Z = 0.5) 入口側
    (-0.4 -0.4  0.5) // 4
    ( 0.4 -0.4  0.5) // 5
    ( 0.4  0.4  0.5) // 6
    (-0.4  0.4  0.5) // 7
);

blocks
(
    // 【変更】ベースメッシュサイズ: 10mm (0.01m) に変更
    // 以前の5mm設定だと背景だけで600万セルを超えていたため、
    // ここを削減するのが最も効果的です。
    // X: 80分割, Y: 80分割, Z: 120分割 -> 約76.8万セル
    hex (0 1 2 3 4 5 6 7) (40 40 60) simpleGrading (1 1 1)
);

defaultPatch
{
    type patch;
}

boundary ();

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //