tello-v12-custom/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      p;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.0;
boundaryField
{
    outlet-2
    {
        type totalPressure;
        p0 uniform 0;
        value uniform 0;
    }
    inlet-2
    {
        type totalPressure;
        p0 uniform 0;
        value uniform 0;
    }
    side-2
    {
        type totalPressure;
        p0 uniform 0;
        value uniform 0;
    }
    tello-blade-customv2
    {
        type zeroGradient;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
